// STEP _CPP _homework10 _18.02.22 _task4
/*
«јƒјЌ»≈ 4
»звестны данные курса валют (курс доллара по отношению
к евро) за все мес€цы года и начисленные проценты за каждый мес€ц на депозитном счету в евро. ¬се данные ввод€тс€
пользователем, в том числе и сумма на депозите в евро.
Ќаписать программу, котора€ по запросу пользовател€
(номер мес€ца) выводит в консоль размер допустимой суммы,
которую он может обналичить, при условии, что у него долларова€ карта, обналичить можно не более 50% от начисленной
суммы в том случае, если начисленна€ сумма в этот мес€ц
составл€ет не менее 500$.
*/

#include <iostream>
#include <stdlib.h>
#include <time.h>

int main() {


	setlocale(0, "");



	return 0;
}

